
{
    "results": [
        {
            "id": 1,
            "appName": "Student Management System For Online Learning (SMSOL)",
            "description": "The Student Management System For Online Learning app is the second group project completed at the Full Stack Bootcamp at UNC.  This application allows a teacher to schedule a time for online tutoring with a student.  My responsibilities included the calendar functionality, including a modal that allows users to update events; both sequelize models;  and all of the API routes used to insert, update, and delete calendar events and students.",
            "techUsed": "FullCalendar, Sequelize, MySql, Express, Express-Handlebars, Node.js, Moment.js, Bootstrap, jQuery, Javascript, HTML, CSS",
            "imgLocation": "smsol.png",
            "repoAddress": "https://github.com/jdeleonardis/project2-smsol",
            "deployedAddress": "https://jdeleonardis-project2-smsol.herokuapp.com/"
        },
        {
            "id": 2,
            "appName": "Eat Da Burger",
            "description": "At first glance, the Eat Da Burger app appears to be very simple.  You enter the name of a burger you want to eat, and save it.  Then, you click the 'Devour It' button, and the burger moves to the 'Eaten' side of the page.  However, the deployed app makes use of several learned concepts, including restful APIs (working with a mysql database), express handlebars, object relational mapper (ORM), and the model view controller (MVC) paradigm.",
            "techUsed": "MySql, Express, Express-Handlebars, Node.js, jQuery, Javascript, HTML, CSS",
            "imgLocation": "Eat Da Burger.png",
            "repoAddress": "https://github.com/jdeleonardis/burger",
            "deployedAddress": "https://jdeleonardis-burger-app.herokuapp.com/"
        },
        {
            "id": 3,
            "appName": "Pantry Buddy",
            "description": "The Pantry Buddy app is the first group project completed at the Full Stack Bootcamp at UNC.  This application required selecting a CSS framework we had not used in class (Bulma), two external API calls (Spoonacular and NutritionIX), and another API library (Twitter Typeahead).  The application allows a user to select ingredients in their pantry, retrieve a list of recipes based on those ingredients, and view nutritional information when recipes are clicked.",
            "techUsed": "Bulma framework, External APIs Spoonacular and NutritionIX, Twitter Typeahead, Bloodhound.js, jQuery, Javascript, HTML, CSS",
            "imgLocation": "pantrybuddy.png",
            "repoAddress": "https://github.com/jdeleonardis/project_1_pantry_buddy",
            "deployedAddress": "https://jdeleonardis.github.io/project_1_pantry_buddy/"
        },
        {
            "id": 4,
            "appName": "Weather Dashboard",
            "description": "This application allows a user to enter a city name.  When that city is entered, the current forecast is displayed, as well as the 5 day forecast. Additionally, the history of cities selected is saved to local storage, and the last city selected is automatically retrieved.  The application calls two different endpoints on a free weather API.",
            "techUsed": "Bootstrap, External API Open Weather Map, jQuery, Javascript, HTML, CSS",
            "imgLocation": "Weather Dashboard.png",
            "repoAddress": "https://github.com/jdeleonardis/homework_6_weather_dashboard",
            "deployedAddress": "https://jdeleonardis.github.io/homework_6_weather_dashboard/"
        },
        {
            "id": 5,
            "appName": "Day Planner",
            "description": "The Day Planner allows a user to save their day's tasks to local storage.  The time blocks are color coded based on the block being in the past, present, or future.  The moment.js library is used to determine the current date and time.",
            "techUsed": "Bootstrap, Moment.js, jQuery, Javascript, HTML, CSS",
            "imgLocation": "Day Planner.png",
            "repoAddress": "https://github.com/jdeleonardis/homework_5_day_planner",
            "deployedAddress": "https://jdeleonardis.github.io/homework_5_day_planner/"
        }
        ,
        {
            "id": 6,
            "appName": "Employee Summary",
            "description": "The Employee Summary application is actually a template engine testing the use of node.js and the npm inquirer and jest modules. In addition, the application tests the knowledge of classes, inheritance, and some debugging of previously existing code.",
            "techUsed": "Bootstrap, npm inquirer, npm jest, jQuery, Javascript, HTML, CSS",
            "imgLocation": "Team Generator.png",
            "repoAddress": "https://github.com/jdeleonardis/homework_10_employee_summary",
            "deployedAddress": "https://jdeleonardis.github.io/homework_10_employee_summary/"
        }              

    ]
}